#网络基础知识:
# http协议默认端口号为80,https协议默认端口号为443

#请描述ip,域名,端口的作用是什么?
#ip:唯一定位一台互联网上的设备(127.0.0.1为本机地址)
#域名:降低IP地址的书写与记忆成本(localhost为本机域名)
#端口:每一个程序启动运行后都会占用一个端口(0-65535)
#http:超文本传输协议,规定了客户端和服务器之间数据传输的规则
# (只有在请求及响应中都遵守统一的规则,服务端才能读懂客户端发送来的请求,客户端才能解析服务端响应的结果)
"""
特点:
    基于文本的协议:请求和响应的部分的协议内容为文本格式,底层通过TCP协议传输,稳定性强.
    基于请求-响应模型:一次请求对应一次响应,必须由客户端先发起请求,服务端才会返回响应.
    无状态:服务端不会记忆与客户端的历史交互信息,每次请求-响应都是独立的

1.TCP/IP四层网络模型?
应用层,传输层,网络层,网络接口层

2. 什么是http协议?有什么特点?
超文本传输协议,规定了客户端与服务端数据传输的规则
基于文本的协议,基于请求响应模型,无状态

"""
#---------------------------------http协议-请求数据格式---------------------------------------------
"""
POST /api/courses HTTP/1.1    请求头(请求方式,资源路径,协议)
                                
                              请求头(格式key:value)
                              
{"phone":"18808088080","channel":"1","name":"虎咆","gender":1}   
请求体(请求参数部分,GET方式没有,POST可以有)

请求方式:
GET:请求参数在请求行中,没有请求体.如/api/courses?name = Python & status = 1. GET请求请求参数大小在浏览器中是有限制的
POST:请求参数在请求体中,POST请求大小事没有限制的.

状态码:
200:客户端请求成功
400:请求参数错误
404:请求资源不存在,url输入有误,或者网络资源被删除了
500:服务器发生了不可预期的错误
4开头都是客户端参数错误,5开头都是服务器错误

1.http协议中请求及响应数据的数据格式?
请求格式:请求行(请求方式,资源路径),请求头(key:value),请求体(post方式)
相应格式:响应行(协议,状态码),响应头(格式key:value),响应体(存放服务端相应的数据)

"""
#---------------------------------------------Apifox接口测试-----------------------------------------------
"""
"messages":
    {"role":"system","content":"你是一个严谨的AI助手,你的名字叫D老师,请以理性严谨的语气来回答用户的问题"},
    {"role":"user","content":"你是谁?"},
    {"role":"assistant","content":"我是D老师!随时准备帮你解决问题或陪你聊天"}
    
    这里"role":"system":设定AI的身份和行为准则(回答的风格,限制,规则等)
    "role":"user":用户实际提出的问题或指令
    "role":"assistant":AI模型的回复/响应的内容
    
回话记忆-处理方案(回话历史滚雪球)
    与AI大模型的交互本质是无状态的,每一次请求响应都是相互独立的.(AI大模型本身没有真正的会话记忆能力)
    如果要解决ai大模型记忆的问题直接在messages中追加历史消息即可
    
    
"""




















