#1. 大模型对话交互
#2. 会话记忆
#3. 伴侣性格定制
#4. 会话管理
#5. 大模型部署方案
#6. HTTP协议
#7. 大模型交互方案
#8. 大模型会话记忆方案
#9. Streamlit构建页面
#10. 文件基本操作
#11. json操作
#12. os/datetime模块

#------------------------------------------知识扩展------------------------------------------------------
'''
路径写法:
1. 相对路径:相对于当前文件的路径
2. 绝对路径:从根目录开始的路径
3. .. : 上一级目录
4. .  : 当前目录
5. /  :表示根目录


操作模式:
1. r : 只读的方式打开文件,指针放在文件的开头.
2. w : 只写入的方式打开文件,如果文件存在则覆盖,如果文件不存在则创建.
3. a : 追加模式,新内容追加在文件末尾,如果文件不存在则创建.

'''
#文件操作
#读文件
with open("resources/测试文件","r",encoding="utf-8") as f:
    content = f.read()
    print(content)

#写文件
with open("resources/测试文件","w",encoding="utf-8") as f:
    f.write("静夜思(李白)\n\n")
    f.write("床前明月光，疑是地上霜。\n")
    f.write("举头望明月，低头思故乡。\n")
    print("写入完成")

with open("resources/测试文件","a",encoding="utf-8") as f:
    f.write("追加内容\n")
    print("追加完成")





























