#列表-介绍
    # 列表是数据容器中的一类,是一次性可以存储多个数据(元素)的
    # 定义: 列表名称 = [元素1,元素2,元素3,元素4,元素5...]   s = [54,15,75,108,23,78,75]
    #特点:
        # 可以存储不同类型的元素
        # 元素有序,可以重复,元素可以修改
        # 下标正向索引是从0开始的,反向索引是从-1开始的
# s = [56,123,122,90,"A","hello",True]
# #获取
# print(s[0])
# print(s[-7])
# #修改
# s[4] = "nihao"
# print(s[4])
# #删除
# del s[3]
# print(s)
# #遍历
# for i in s:
#     print(i)
#
# print(type(s))

#列表的切片
# 语法: 序列数据[开始索引:结束索引:步长]
    #不包含结束索引位置对应的元素,步长不写默认为1
    #索引采用正向,反向索引都可以
    #步长是选取间隔,默认步长为1

# s = ["a","b","c","d","e","f","g","h","i","j"]
# #[开始索引:结束索引:步长]
# print(s[:5:2])
# print(type(s[0:1:1]))
# a = s[:1]
# print(a)
# print(s[::-1])
# print(s[::1])

#列表的常见方法
"""
    append() 在列表的尾部追加元素 s.append(10086)
    insert() 在指定索引之前,插入该元素  s.insert(0,92)
    remove() 移除列表中第一个匹配到的值  s.remove(75)
    pop() 阐述列表中索引位置的元素(如果未指定索引,默认删最后一个) s.pop(2)/s.pop()
    sort() 对列表机械能排序(列表元素的数据类型一致,才可以进行排序)s.sort() 默认从小到大进行排序
    reverse() 反战列表元素    s.reverse()
"""

s = ["a","b","c","d","e","f","g","h","i","j"]
a = s.pop(2)
s.sort()
s.reverse()
print(a)
print(s)