# 2026年9月20日 34-49级已学完
#元组: 元组一旦定义完成,不可修改
#元组是不可变的序列,类似于列表,但创建之后不能被修改
    #特点:可以存储不同类型的元素
    #元素可以重复,有序,不可以修改(支持索引访问,切片)
    #定义:
    # 元组名称 = (元素1,元素2,...)
    # #定义空元组
    # 元组名称 = ()
    # 元组名称 = tuple()
#方法:
    #count():统计某元素在元组中出现的次数
    #index():查找某个元素在元组中的索引位置(第一次出现的位置)
# t1 = (1,2,3,4,5,5,213,23,6,1,3,2)
# print(t1.index(1))
# print(t1.count(5))


# -------------------------------元组的组包和解包----------------------------------------
#元组的组包和解包
#组包:将多个值合并到一个容器(元祖,列表)中
#解包: 将容器(元组,列表)解开成独立的元素,分别赋值给多个变量.
#基础解包(变量数量与容器的元素个数需要一致,不然会报错)
# t1 = (5,7,9,1)
# a,b,c,d = t1
# print(a)
#
# #(*)扩展解包(* 收集剩余的所有元素,封装到列表list中)
# x,*y,z = t1 #x为5,y为[7,9],z为1
# print(*y)
# s,*o = t1   #s为5,*o为[7,9,1]
# print(*o)
# *a,e=t1     #*a为[5,7,9],e为1
# print(*a)
#元素在解包时,*表示手机剩余所有的元素,允许我们处理不确定数量的元素
#生成列表,以便于可以进行进一步的处理

# a = 100
# b = 200
# c = 300
# c,a,b = a,b,c
# print(a,b,c)

#案例 : 根据提供的学生成绩单,完成如下需求:
    #1. 计算每个学生的总分,各科平均分,然后一并输出出来.
    #2. 统计各科成交的最低分,最高分,平均分,并输出.
    #3. 查找成绩优秀(平均分大于90)的学生,并输出

students = (
    ("S001","王林",85,92,78),
    ("S002","李慕婉",92,88,95),
    ("S003","十三",78,85,82),
    ("S004","增牛",88,79,91),
    ("S005","周铁",95,96,89),
    ("S006","王卓",76,82,77),
    ("S007","红蝶",89,91,94),
    ("S008","徐立国",75,69,82),
    ("S009","许木",86,89,98),
    ("S010","遁天",86,59,72)
)
#1. 计算每个学生的总分,各科平均分,然后一并输出出来.
#方式一
# for i in students:
#     total = i[2]+i[3]+i[4]
#     avg = total/3
#     print(f"学号为{i[0]}的学生 {i[1]},总分为:{total},平均分为:{avg:.2f}")
# print()

#方式二:解包
for id,name,yuwen,shuxue,yingyu in students:
    total = yuwen+shuxue+yingyu
    avg = total/3
    print(f"{id} \t {name} \t {yuwen} \t {shuxue} \t {yingyu} \t {avg:.2f}")
#2. 统计各科成交的最低分,最高分,平均分,并输出.
yuwen = [i[2] for i in students]
shuxue = [i[3] for i in students]
yingyu = [i[4] for i in students]
print(f"语文最高分为:{max(yuwen)},最低分为:{min(yuwen)},平均分为:{sum(yuwen)/len(yuwen):.2f}")
print(f"数学最高分为:{max(shuxue)},最低分为:{min(shuxue)},平均分为:{sum(shuxue)/len(shuxue):.2f}")
print(f"英语最高分为:{max(yingyu)},最低分为:{min(yingyu)},平均分为:{sum(yingyu)/len(yingyu):.2f}")
print()
#3. 查找成绩优秀(平均分大于90)的学生,并输出
for i in students:
    total = i[2]+i[3]+i[4]
    avg = total/3
    if avg > 90:
        print(f"学号:{i[0]},姓名:{i[1]},平均分:{avg:.2f}")
