# 算数运算符
# /:除法  10/5 = 2.0  除法结果都为小数
# //:整除 10//3 = 3  整除结果取整
# %:取余/求摸  10%3 = 1  10除3取余数
# **:幂指数  10 ** 3 :10 的 3次方

# a = 10/3
# print(a)
# b = 10//3
# print(b)
# print("10 ** 4 = ",10 ** 4) #10的4次方
#优先级 **  ---  * / // % ----  + -  (从高到低)

# #案例1:要求输入两个数x与y,分别输出x+y的结果和x-y的结果
#
# x = float(input("请输入x的值:"))
# y = float(input("请输入y的值:"))
# print("x+y=",x+y)
# # 精度损失,设计到浮点数的计算时,可能会损失精度,属于正常情况
# print("x-y=",x-y)

#text1 计算输入的三个整数的平均数
# num1 = int(input("请输入第一个整数:"))
# num2 = int(input("请输入第二个整数:"))
# num3 = int(input("请输入第三个整数:"))
# avg = (num1+num2+num3)/3
# print(f"三个整数的平均数为{avg}")

#text2 要求输入梯形的上底,下底,高,然后计算梯形的面积
# a = float(input("请输入梯形的上底:"))
# b = float(input("请输入梯形的下底:"))
# h = float(input("请输入梯形的高:"))
# s = (a+b)*h/2
# print(f"梯形的面积为{s}")

#text3 要求输入圆的半径,然后计算圆的周长和面积(周长:2πr,面积:πr^2)
# r = float(input("请输入圆的半径"))
# pi = 3.14
# chang = 2*pi*r
# mianji = pi*r ** 2
# print(f"圆的周长为{chang:.2f},圆的面积为{mianji:.2f}")
#.2f 为保留2位小数

#text4 身体指数BMI的计算(BMI=体重(kg) / 身高(m)^2)
#1.输入体重(单位(kg))
# 2.输入身高(单位m)
# 3.计算身体质量指数BMI并输出

# kg = float(input("请输入您的体重(kg)"))
# m = float(input("请输入您的身高(m)"))
# bmi = kg / (m**2)
# print(f"您的身体质量指数BMI为:{bmi}")

#赋值运算符
# num+=2 == num = num + 2
# # num-=2 == num = num - 2
# num%=2 == num = num % 2
#*=  /=  %=  //=  **=  意思都一样,形式也是一样的
# 例如
# num = 1
# num+=2
# print(num)

#比较运算符
# True -表示比较关系成立- 1  False - 表示比较关系不成立- 0

#逻辑运算符---
# 逻辑运算符用于连接多个条件(布尔)表达式(其值为"真"或者"假"),并返回一个最终布尔结果的运算符
# and 逻辑与(并且)   同时成立才是符合条件的(左右两边都为True,结果才为True)
# or 逻辑或(或者)   只要有一个符合要求的即可(只要左右两边有一个True,结果就为True)
# not 逻辑非(取反)   取反操作,True变为False,False变为True
# a = int(input("请输入一个整数:"))
# m = a>=10 and a<=20
# print(m)

num = int(input("请输入一个整数:"))

print(f"{num}不在10-20之间", num<10 or num>20)

# 什么是逻辑运算符?
# 逻辑运算符用于连接多个布尔表达式(True或False),并返回最终的一个布尔值
# 有哪些逻辑运算符?
# and(并且,同时满足)
# or(或者,满足其一)
# not(非,取反操作)